#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
github_team.k8sauto: Refreshing state... [id=5194777]
github_repository.iac_k8sauto_team: Refreshing state... [id=iac-k8sauto-team]
github_team_repository.iac_k8sauto_team: Refreshing state... [id=5194777:iac-k8sauto-team]
tfe_workspace.iac_k8sauto_team: Refreshing state... [id=ws-8CK1vNn6NX51tb8r]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.iac_k8sauto_team has been changed
  ~ resource "github_repository" "iac_k8sauto_team" {
      ~ default_branch         = "main" -> "master"
      ~ etag                   = "W/\"6c6a45197c0ddd474c0ad716dacb53c5fef4e5dcd3c19121ee8269448e5ea219\"" -> "W/\"661c04b0a0ae4444b55f326f4e2f259aeed4c253a7f221bc8aa226b35d5dc367\""
        id                     = "iac-k8sauto-team"
        name                   = "iac-k8sauto-team"
      + topics                 = []
        # (22 unchanged attributes hidden)
    }
  # github_team_repository.iac_k8sauto_team has been changed
  ~ resource "github_team_repository" "iac_k8sauto_team" {
      ~ etag       = "W/\"86aacdc86b2ef2ae82f92416c9618f88644afac7367b7261ad085aa66ae676b2\"" -> "W/\"ae35d07e823542a3e9896136df1ba16482eec7f3a13981c35469b955127e5a79\""
        id         = "5194777:iac-k8sauto-team"
        # (3 unchanged attributes hidden)
    }
  # tfe_workspace.iac_k8sauto_team has been changed
  ~ resource "tfe_workspace" "iac_k8sauto_team" {
        id                            = "ws-8CK1vNn6NX51tb8r"
        name                          = "iac-k8sauto-team"
      + remote_state_consumer_ids     = []
      + trigger_prefixes              = []
        # (12 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.repos["iac-tkg-azure"] will be created
  + resource "github_repository" "repos" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "IaC repo for TKG on Azure"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "iac-tkg-azure"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_team_repository.team_repos["iac-tkg-azure"] will be created
  + resource "github_team_repository" "team_repos" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "iac-tkg-azure"
      + team_id    = (known after apply)
    }

  # tfe_workspace.workspaces["iac-tkg-azure"] will be created
  + resource "tfe_workspace" "workspaces" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "IaC repo for TKG on Azure"
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "iac-tkg-azure"
      + operations                    = (known after apply)
      + organization                  = "Diehlabs"
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "k8s",
          + "test",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*